dansparrow99/nRF5_SDK_SMARTMASK/examples/ble_peripheral - Copy/Senior Design Proj/main.c
    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
}

///////////////////////////////////ADDED METHODS////////////////////////////////////////////

/**
 * @brief Function for handling data from temperature sensor.
 *
 * @param[in] temp          Temperature in Celsius degrees read from sensor.
 */
__STATIC_INLINE void data_handler(uint8_t temp[])
{
	
    NRF_LOG_INFO("First Data Point: %d \r\n", temp[0]);
}

/**
 * @brief Function for setting normal T/P/H mode on BME280
 */
void BME280_init(void)
{
    ret_code_t err_code;
    uint8_t reg[3] = {BME280_SETUP_REG_ADDR, BME280_SETUP_REG_DATA[0],BME280_SETUP_REG_DATA[1]};
    err_code = nrf_drv_twi_tx(&m_twi, SLAVE_ADDR, reg, sizeof(reg), false);
		APP_ERROR_CHECK(err_code);
    while (m_xfer_done == false);
}

/**
 * @brief Function for reading BME280 status
 */
void BME280_status_read(void)
{
    m_xfer_done = false;
		uint8_t reg = 0xF3U;
    /* Read 8 bytes from the specified address - skip 3 bits dedicated for fractional part of temperature. */
		ret_code_t err_code = nrf_drv_twi_tx(&m_twi, SLAVE_ADDR, &reg, sizeof(reg),false);
		APP_ERROR_CHECK(err_code);
		while(m_xfer_done==false);
		err_code = nrf_drv_twi_rx(&m_twi, SLAVE_ADDR, sensor_data, 1);
    APP_ERROR_CHECK(err_code);
		while(m_xfer_done==false);
}
/**
 * @brief TWI events handler.
 */
void twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
    switch (p_event->type)
    {
        case NRF_DRV_TWI_EVT_DONE:
            if (p_event->xfer_desc.type == NRF_DRV_TWI_XFER_RX)
            {
                data_handler(sensor_data);
            }
            m_xfer_done = true;
            break;
        default:
            break;
    }
}

/**
 * @brief UART initialization.
 */
void twi_init (void)
{
    ret_code_t err_code;

    const nrf_drv_twi_config_t twi_BME280_config = {
       .scl                = ARDUINO_SCL_PIN,
       .sda                = ARDUINO_SDA_PIN,
       .frequency          = NRF_TWI_FREQ_100K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    err_code = nrf_drv_twi_init(&m_twi, &twi_BME280_config, twi_handler, NULL);
    APP_ERROR_CHECK(err_code);

    nrf_drv_twi_enable(&m_twi);
}

/**
 * @brief Function for reading data from temperature sensor.
 */
static void read_sensor_data()
{
    m_xfer_done = false;
		uint8_t reg[1] = {BME280_READ_REG};
    /* Read 8 bytes from the specified address - skip 3 bits dedicated for fractional part of temperature. */
		ret_code_t err_code = nrf_drv_twi_tx(&m_twi, SLAVE_ADDR, reg, sizeof(reg),false);  
		APP_ERROR_CHECK(err_code);
		while(m_xfer_done==false);
		err_code = nrf_drv_twi_rx(&m_twi, SLAVE_ADDR, sensor_data, sizeof(sensor_data));
    APP_ERROR_CHECK(err_code);
		while(m_xfer_done==false);
}
/////////////////////////////////END ADDED METHODS//////////////////////////////////////////

/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool     erase_bonds;

    // Initialize.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    uart_init();
    log_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

		twi_init();

	
    printf("\r\nUART Startt!\r\n");
    NRF_LOG_INFO("UART Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

/*		for(int i =0;i<8;i++){
		printf("pre-read%i\n",(int)sensor_data[i]);
		}
		for(int i =0;i<8;i++){
		printf("post-read%i\n",(int)sensor_data[i]);
		}
		// Enter main loop.*/
		BME280_init();
		int i =0;
		//the main running loop
    for (;;)
    {
			i++;
			printf("\r\niter: %i\r\n",i);
			nrf_delay_ms(1000);
			//TWI communication
			err_code = ble_nus_string_send(&m_nus, sensor_data, 8);
			read_sensor_data();
			//output to nRF UART 2.0 App
			for(int x=0;x<SAMPLE_SIZE;x++){
				printf("sensor[%i]= %i\r\n",x,sensor_data[x]);
			}
			//do not touch
			power_manage();
    }
}


/**
 * @}
 */
